K6/results/staged_results_20250706163626.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_staged.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m20s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 2m50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.0s/2m50.0s

running (0m02.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m02.0s/2m50.0s

running (0m03.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 03/50 VUs  0m03.0s/2m50.0s

running (0m04.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 04/50 VUs  0m04.0s/2m50.0s

running (0m05.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m05.0s/2m50.0s

running (0m06.0s), 06/50 VUs, 14 complete and 0 interrupted iterations
default   [   4% ] 06/50 VUs  0m06.0s/2m50.0s

running (0m07.0s), 07/50 VUs, 20 complete and 0 interrupted iterations
default   [   4% ] 07/50 VUs  0m07.0s/2m50.0s

running (0m08.0s), 08/50 VUs, 27 complete and 0 interrupted iterations
default   [   5% ] 08/50 VUs  0m08.0s/2m50.0s

running (0m09.0s), 09/50 VUs, 35 complete and 0 interrupted iterations
default   [   5% ] 09/50 VUs  0m09.0s/2m50.0s

running (0m10.0s), 09/50 VUs, 44 complete and 0 interrupted iterations
default   [   6% ] 09/50 VUs  0m10.0s/2m50.0s

running (0m11.0s), 10/50 VUs, 52 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m11.0s/2m50.0s

running (0m12.0s), 10/50 VUs, 62 complete and 0 interrupted iterations
default   [   7% ] 10/50 VUs  0m12.0s/2m50.0s

running (0m13.0s), 10/50 VUs, 71 complete and 0 interrupted iterations
default   [   8% ] 10/50 VUs  0m13.0s/2m50.0s

running (0m14.0s), 11/50 VUs, 80 complete and 0 interrupted iterations
default   [   8% ] 11/50 VUs  0m14.0s/2m50.0s

running (0m15.0s), 11/50 VUs, 91 complete and 0 interrupted iterations
default   [   9% ] 11/50 VUs  0m15.0s/2m50.0s

running (0m16.0s), 11/50 VUs, 98 complete and 0 interrupted iterations
default   [   9% ] 11/50 VUs  0m16.0s/2m50.0s

running (0m17.0s), 12/50 VUs, 109 complete and 0 interrupted iterations
default   [  10% ] 12/50 VUs  0m17.0s/2m50.0s

running (0m18.0s), 12/50 VUs, 121 complete and 0 interrupted iterations
default   [  11% ] 12/50 VUs  0m18.0s/2m50.0s

running (0m19.0s), 12/50 VUs, 133 complete and 0 interrupted iterations
default   [  11% ] 12/50 VUs  0m19.0s/2m50.0s

running (0m20.0s), 13/50 VUs, 144 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m20.0s/2m50.0s

running (0m21.0s), 13/50 VUs, 157 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m21.0s/2m50.0s

running (0m22.0s), 13/50 VUs, 170 complete and 0 interrupted iterations
default   [  13% ] 13/50 VUs  0m22.0s/2m50.0s

running (0m23.0s), 14/50 VUs, 183 complete and 0 interrupted iterations
default   [  14% ] 14/50 VUs  0m23.0s/2m50.0s

running (0m24.0s), 14/50 VUs, 193 complete and 0 interrupted iterations
default   [  14% ] 14/50 VUs  0m24.0s/2m50.0s

running (0m25.0s), 14/50 VUs, 206 complete and 0 interrupted iterations
default   [  15% ] 14/50 VUs  0m25.0s/2m50.0s

running (0m26.0s), 15/50 VUs, 220 complete and 0 interrupted iterations
default   [  15% ] 15/50 VUs  0m26.0s/2m50.0s

running (0m27.0s), 15/50 VUs, 235 complete and 0 interrupted iterations
default   [  16% ] 15/50 VUs  0m27.0s/2m50.0s

running (0m28.0s), 15/50 VUs, 249 complete and 0 interrupted iterations
default   [  16% ] 15/50 VUs  0m28.0s/2m50.0s

running (0m29.0s), 16/50 VUs, 263 complete and 0 interrupted iterations
default   [  17% ] 16/50 VUs  0m29.0s/2m50.0s

running (0m30.0s), 16/50 VUs, 279 complete and 0 interrupted iterations
default   [  18% ] 16/50 VUs  0m30.0s/2m50.0s

running (0m31.0s), 16/50 VUs, 294 complete and 0 interrupted iterations
default   [  18% ] 16/50 VUs  0m31.0s/2m50.0s

running (0m32.0s), 17/50 VUs, 310 complete and 0 interrupted iterations
default   [  19% ] 17/50 VUs  0m32.0s/2m50.0s

running (0m33.0s), 17/50 VUs, 324 complete and 0 interrupted iterations
default   [  19% ] 17/50 VUs  0m33.0s/2m50.0s

running (0m34.0s), 17/50 VUs, 337 complete and 0 interrupted iterations
default   [  20% ] 17/50 VUs  0m34.0s/2m50.0s

running (0m35.0s), 18/50 VUs, 353 complete and 0 interrupted iterations
default   [  21% ] 18/50 VUs  0m35.0s/2m50.0s

running (0m36.0s), 18/50 VUs, 371 complete and 0 interrupted iterations
default   [  21% ] 18/50 VUs  0m36.0s/2m50.0s

running (0m37.0s), 18/50 VUs, 389 complete and 0 interrupted iterations
default   [  22% ] 18/50 VUs  0m37.0s/2m50.0s

running (0m38.0s), 19/50 VUs, 406 complete and 0 interrupted iterations
default   [  22% ] 19/50 VUs  0m38.0s/2m50.0s

running (0m39.0s), 19/50 VUs, 425 complete and 0 interrupted iterations
default   [  23% ] 19/50 VUs  0m39.0s/2m50.0s

running (0m40.0s), 19/50 VUs, 444 complete and 0 interrupted iterations
default   [  24% ] 19/50 VUs  0m40.0s/2m50.0s

running (0m41.0s), 20/50 VUs, 460 complete and 0 interrupted iterations
default   [  24% ] 20/50 VUs  0m41.0s/2m50.0s

running (0m42.0s), 20/50 VUs, 479 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  0m42.0s/2m50.0s

running (0m43.0s), 20/50 VUs, 494 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  0m43.0s/2m50.0s

running (0m44.0s), 20/50 VUs, 513 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  0m44.0s/2m50.0s

running (0m45.0s), 21/50 VUs, 529 complete and 0 interrupted iterations
default   [  26% ] 21/50 VUs  0m45.0s/2m50.0s

running (0m46.0s), 21/50 VUs, 550 complete and 0 interrupted iterations
default   [  27% ] 21/50 VUs  0m46.0s/2m50.0s

running (0m47.0s), 21/50 VUs, 564 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  0m47.0s/2m50.0s

running (0m48.0s), 21/50 VUs, 583 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  0m48.0s/2m50.0s

running (0m49.0s), 22/50 VUs, 604 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  0m49.0s/2m50.0s

running (0m50.0s), 22/50 VUs, 626 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  0m50.0s/2m50.0s

running (0m51.0s), 22/50 VUs, 648 complete and 0 interrupted iterations
default   [  30% ] 22/50 VUs  0m51.0s/2m50.0s

running (0m52.0s), 22/50 VUs, 668 complete and 0 interrupted iterations
default   [  31% ] 22/50 VUs  0m52.0s/2m50.0s

running (0m53.0s), 23/50 VUs, 690 complete and 0 interrupted iterations
default   [  31% ] 23/50 VUs  0m53.0s/2m50.0s

running (0m54.0s), 23/50 VUs, 713 complete and 0 interrupted iterations
default   [  32% ] 23/50 VUs  0m54.0s/2m50.0s

running (0m55.0s), 23/50 VUs, 730 complete and 0 interrupted iterations
default   [  32% ] 23/50 VUs  0m55.0s/2m50.0s

running (0m56.0s), 23/50 VUs, 751 complete and 0 interrupted iterations
default   [  33% ] 23/50 VUs  0m56.0s/2m50.0s

running (0m57.0s), 24/50 VUs, 774 complete and 0 interrupted iterations
default   [  34% ] 24/50 VUs  0m57.0s/2m50.0s

running (0m58.0s), 24/50 VUs, 787 complete and 0 interrupted iterations
default   [  34% ] 24/50 VUs  0m58.0s/2m50.0s

running (0m59.0s), 24/50 VUs, 811 complete and 0 interrupted iterations
default   [  35% ] 24/50 VUs  0m59.0s/2m50.0s

running (1m00.0s), 24/50 VUs, 835 complete and 0 interrupted iterations
default   [  35% ] 24/50 VUs  1m00.0s/2m50.0s

running (1m01.0s), 25/50 VUs, 844 complete and 0 interrupted iterations
default   [  36% ] 25/50 VUs  1m01.0s/2m50.0s

running (1m02.0s), 25/50 VUs, 869 complete and 0 interrupted iterations
default   [  36% ] 25/50 VUs  1m02.0s/2m50.0s

running (1m03.0s), 25/50 VUs, 893 complete and 0 interrupted iterations
default   [  37% ] 25/50 VUs  1m03.0s/2m50.0s

running (1m04.0s), 25/50 VUs, 906 complete and 0 interrupted iterations
default   [  38% ] 25/50 VUs  1m04.0s/2m50.0s

running (1m05.0s), 26/50 VUs, 931 complete and 0 interrupted iterations
default   [  38% ] 26/50 VUs  1m05.0s/2m50.0s

running (1m06.0s), 26/50 VUs, 956 complete and 0 interrupted iterations
default   [  39% ] 26/50 VUs  1m06.0s/2m50.0s

running (1m07.0s), 26/50 VUs, 969 complete and 0 interrupted iterations
default   [  39% ] 26/50 VUs  1m07.0s/2m50.0s

running (1m08.0s), 26/50 VUs, 992 complete and 0 interrupted iterations
default   [  40% ] 26/50 VUs  1m08.0s/2m50.0s

running (1m09.0s), 27/50 VUs, 1017 complete and 0 interrupted iterations
default   [  41% ] 27/50 VUs  1m09.0s/2m50.0s

running (1m10.0s), 27/50 VUs, 1042 complete and 0 interrupted iterations
default   [  41% ] 27/50 VUs  1m10.0s/2m50.0s

running (1m11.0s), 27/50 VUs, 1067 complete and 0 interrupted iterations
default   [  42% ] 27/50 VUs  1m11.0s/2m50.0s

running (1m12.0s), 27/50 VUs, 1094 complete and 0 interrupted iterations
default   [  42% ] 27/50 VUs  1m12.0s/2m50.0s

running (1m13.0s), 28/50 VUs, 1114 complete and 0 interrupted iterations
default   [  43% ] 28/50 VUs  1m13.0s/2m50.0s

running (1m14.0s), 28/50 VUs, 1142 complete and 0 interrupted iterations
default   [  44% ] 28/50 VUs  1m14.0s/2m50.0s

running (1m15.0s), 28/50 VUs, 1170 complete and 0 interrupted iterations
default   [  44% ] 28/50 VUs  1m15.0s/2m50.0s

running (1m16.0s), 28/50 VUs, 1191 complete and 0 interrupted iterations
default   [  45% ] 28/50 VUs  1m16.0s/2m50.0s

running (1m17.0s), 29/50 VUs, 1219 complete and 0 interrupted iterations
default   [  45% ] 29/50 VUs  1m17.0s/2m50.0s

running (1m18.0s), 29/50 VUs, 1239 complete and 0 interrupted iterations
default   [  46% ] 29/50 VUs  1m18.0s/2m50.0s

running (1m19.0s), 29/50 VUs, 1267 complete and 0 interrupted iterations
default   [  46% ] 29/50 VUs  1m19.0s/2m50.0s

running (1m20.0s), 29/50 VUs, 1296 complete and 0 interrupted iterations
default   [  47% ] 29/50 VUs  1m20.0s/2m50.0s

running (1m21.0s), 30/50 VUs, 1325 complete and 0 interrupted iterations
default   [  48% ] 30/50 VUs  1m21.0s/2m50.0s

running (1m22.0s), 30/50 VUs, 1342 complete and 0 interrupted iterations
default   [  48% ] 30/50 VUs  1m22.0s/2m50.0s

running (1m23.0s), 30/50 VUs, 1369 complete and 0 interrupted iterations
default   [  49% ] 30/50 VUs  1m23.0s/2m50.0s

running (1m24.0s), 30/50 VUs, 1398 complete and 0 interrupted iterations
default   [  49% ] 30/50 VUs  1m24.0s/2m50.0s

running (1m25.0s), 31/50 VUs, 1418 complete and 0 interrupted iterations
default   [  50% ] 31/50 VUs  1m25.0s/2m50.0s

running (1m26.0s), 31/50 VUs, 1440 complete and 0 interrupted iterations
default   [  51% ] 31/50 VUs  1m26.0s/2m50.0s

running (1m27.0s), 31/50 VUs, 1471 complete and 0 interrupted iterations
default   [  51% ] 31/50 VUs  1m27.0s/2m50.0s

running (1m28.0s), 31/50 VUs, 1489 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  1m28.0s/2m50.0s

running (1m29.0s), 32/50 VUs, 1516 complete and 0 interrupted iterations
default   [  52% ] 32/50 VUs  1m29.0s/2m50.0s

running (1m30.0s), 32/50 VUs, 1548 complete and 0 interrupted iterations
default   [  53% ] 32/50 VUs  1m30.0s/2m50.0s

running (1m31.0s), 32/50 VUs, 1578 complete and 0 interrupted iterations
default   [  54% ] 32/50 VUs  1m31.0s/2m50.0s

running (1m32.0s), 32/50 VUs, 1604 complete and 0 interrupted iterations
default   [  54% ] 32/50 VUs  1m32.0s/2m50.0s

running (1m33.0s), 33/50 VUs, 1635 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  1m33.0s/2m50.0s

running (1m34.0s), 33/50 VUs, 1666 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  1m34.0s/2m50.0s

running (1m35.0s), 33/50 VUs, 1699 complete and 0 interrupted iterations
default   [  56% ] 33/50 VUs  1m35.0s/2m50.0s

running (1m36.0s), 33/50 VUs, 1727 complete and 0 interrupted iterations
default   [  56% ] 33/50 VUs  1m36.0s/2m50.0s

running (1m37.0s), 34/50 VUs, 1744 complete and 0 interrupted iterations
default   [  57% ] 34/50 VUs  1m37.0s/2m50.0s

running (1m38.0s), 34/50 VUs, 1776 complete and 0 interrupted iterations
default   [  58% ] 34/50 VUs  1m38.0s/2m50.0s

running (1m39.0s), 34/50 VUs, 1810 complete and 0 interrupted iterations
default   [  58% ] 34/50 VUs  1m39.0s/2m50.0s

running (1m40.0s), 34/50 VUs, 1823 complete and 0 interrupted iterations
default   [  59% ] 34/50 VUs  1m40.0s/2m50.0s

running (1m41.0s), 35/50 VUs, 1857 complete and 0 interrupted iterations
default   [  59% ] 35/50 VUs  1m41.0s/2m50.0s

running (1m42.0s), 35/50 VUs, 1891 complete and 0 interrupted iterations
default   [  60% ] 35/50 VUs  1m42.0s/2m50.0s

running (1m43.0s), 35/50 VUs, 1904 complete and 0 interrupted iterations
default   [  61% ] 35/50 VUs  1m43.0s/2m50.0s

running (1m44.0s), 35/50 VUs, 1939 complete and 0 interrupted iterations
default   [  61% ] 35/50 VUs  1m44.0s/2m50.0s

running (1m45.0s), 36/50 VUs, 1974 complete and 0 interrupted iterations
default   [  62% ] 36/50 VUs  1m45.0s/2m50.0s

running (1m46.0s), 36/50 VUs, 1983 complete and 0 interrupted iterations
default   [  62% ] 36/50 VUs  1m46.0s/2m50.0s

running (1m47.0s), 36/50 VUs, 2018 complete and 0 interrupted iterations
default   [  63% ] 36/50 VUs  1m47.0s/2m50.0s

running (1m48.0s), 36/50 VUs, 2054 complete and 0 interrupted iterations
default   [  64% ] 36/50 VUs  1m48.0s/2m50.0s

running (1m49.0s), 37/50 VUs, 2060 complete and 0 interrupted iterations
default   [  64% ] 37/50 VUs  1m49.0s/2m50.0s

running (1m50.0s), 37/50 VUs, 2097 complete and 0 interrupted iterations
default   [  65% ] 37/50 VUs  1m50.0s/2m50.0s

running (1m51.0s), 37/50 VUs, 2116 complete and 0 interrupted iterations
default   [  65% ] 37/50 VUs  1m51.0s/2m50.0s

running (1m52.0s), 37/50 VUs, 2139 complete and 0 interrupted iterations
default   [  66% ] 37/50 VUs  1m52.0s/2m50.0s

running (1m53.0s), 38/50 VUs, 2175 complete and 0 interrupted iterations
default   [  66% ] 38/50 VUs  1m53.0s/2m50.0s

running (1m54.0s), 38/50 VUs, 2204 complete and 0 interrupted iterations
default   [  67% ] 38/50 VUs  1m54.0s/2m50.0s

running (1m55.0s), 38/50 VUs, 2232 complete and 0 interrupted iterations
default   [  68% ] 38/50 VUs  1m55.0s/2m50.0s

running (1m56.0s), 38/50 VUs, 2269 complete and 0 interrupted iterations
default   [  68% ] 38/50 VUs  1m56.0s/2m50.0s

running (1m57.0s), 39/50 VUs, 2302 complete and 0 interrupted iterations
default   [  69% ] 39/50 VUs  1m57.0s/2m50.0s

running (1m58.0s), 39/50 VUs, 2330 complete and 0 interrupted iterations
default   [  69% ] 39/50 VUs  1m58.0s/2m50.0s

running (1m59.0s), 39/50 VUs, 2369 complete and 0 interrupted iterations
default   [  70% ] 39/50 VUs  1m59.0s/2m50.0s

running (2m00.0s), 39/50 VUs, 2400 complete and 0 interrupted iterations
default   [  71% ] 39/50 VUs  2m00.0s/2m50.0s

running (2m01.0s), 40/50 VUs, 2427 complete and 0 interrupted iterations
default   [  71% ] 40/50 VUs  2m01.0s/2m50.0s

running (2m02.0s), 40/50 VUs, 2462 complete and 0 interrupted iterations
default   [  72% ] 40/50 VUs  2m02.0s/2m50.0s

running (2m03.0s), 40/50 VUs, 2501 complete and 0 interrupted iterations
default   [  72% ] 40/50 VUs  2m03.0s/2m50.0s

running (2m04.0s), 40/50 VUs, 2538 complete and 0 interrupted iterations
default   [  73% ] 40/50 VUs  2m04.0s/2m50.0s

running (2m05.0s), 41/50 VUs, 2568 complete and 0 interrupted iterations
default   [  74% ] 41/50 VUs  2m05.0s/2m50.0s

running (2m06.0s), 41/50 VUs, 2608 complete and 0 interrupted iterations
default   [  74% ] 41/50 VUs  2m06.0s/2m50.0s

running (2m07.0s), 41/50 VUs, 2644 complete and 0 interrupted iterations
default   [  75% ] 41/50 VUs  2m07.0s/2m50.0s

running (2m08.0s), 41/50 VUs, 2670 complete and 0 interrupted iterations
default   [  75% ] 41/50 VUs  2m08.0s/2m50.0s

running (2m09.0s), 42/50 VUs, 2709 complete and 0 interrupted iterations
default   [  76% ] 42/50 VUs  2m09.0s/2m50.0s

running (2m10.0s), 42/50 VUs, 2743 complete and 0 interrupted iterations
default   [  76% ] 42/50 VUs  2m10.0s/2m50.0s

running (2m11.0s), 42/50 VUs, 2773 complete and 0 interrupted iterations
default   [  77% ] 42/50 VUs  2m11.0s/2m50.0s

running (2m12.0s), 42/50 VUs, 2814 complete and 0 interrupted iterations
default   [  78% ] 42/50 VUs  2m12.0s/2m50.0s

running (2m13.0s), 43/50 VUs, 2842 complete and 0 interrupted iterations
default   [  78% ] 43/50 VUs  2m13.0s/2m50.0s

running (2m14.0s), 43/50 VUs, 2881 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  2m14.0s/2m50.0s

running (2m15.0s), 43/50 VUs, 2916 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  2m15.0s/2m50.0s

running (2m16.0s), 43/50 VUs, 2945 complete and 0 interrupted iterations
default   [  80% ] 43/50 VUs  2m16.0s/2m50.0s

running (2m17.0s), 44/50 VUs, 2986 complete and 0 interrupted iterations
default   [  81% ] 44/50 VUs  2m17.0s/2m50.0s

running (2m18.0s), 44/50 VUs, 3027 complete and 0 interrupted iterations
default   [  81% ] 44/50 VUs  2m18.0s/2m50.0s

running (2m19.0s), 44/50 VUs, 3061 complete and 0 interrupted iterations
default   [  82% ] 44/50 VUs  2m19.0s/2m50.0s

running (2m20.0s), 44/50 VUs, 3087 complete and 0 interrupted iterations
default   [  82% ] 44/50 VUs  2m20.0s/2m50.0s

running (2m21.0s), 45/50 VUs, 3131 complete and 0 interrupted iterations
default   [  83% ] 45/50 VUs  2m21.0s/2m50.0s

running (2m22.0s), 45/50 VUs, 3164 complete and 0 interrupted iterations
default   [  84% ] 45/50 VUs  2m22.0s/2m50.0s

running (2m23.0s), 45/50 VUs, 3204 complete and 0 interrupted iterations
default   [  84% ] 45/50 VUs  2m23.0s/2m50.0s

running (2m24.0s), 45/50 VUs, 3237 complete and 0 interrupted iterations
default   [  85% ] 45/50 VUs  2m24.0s/2m50.0s

running (2m25.0s), 46/50 VUs, 3276 complete and 0 interrupted iterations
default   [  85% ] 46/50 VUs  2m25.0s/2m50.0s

running (2m26.0s), 46/50 VUs, 3313 complete and 0 interrupted iterations
default   [  86% ] 46/50 VUs  2m26.0s/2m50.0s

running (2m27.0s), 46/50 VUs, 3348 complete and 0 interrupted iterations
default   [  86% ] 46/50 VUs  2m27.0s/2m50.0s

running (2m28.0s), 46/50 VUs, 3382 complete and 0 interrupted iterations
default   [  87% ] 46/50 VUs  2m28.0s/2m50.0s

running (2m29.0s), 47/50 VUs, 3427 complete and 0 interrupted iterations
default   [  88% ] 47/50 VUs  2m29.0s/2m50.0s

running (2m30.0s), 47/50 VUs, 3443 complete and 0 interrupted iterations
default   [  88% ] 47/50 VUs  2m30.0s/2m50.0s

running (2m31.0s), 47/50 VUs, 3490 complete and 0 interrupted iterations
default   [  89% ] 47/50 VUs  2m31.0s/2m50.0s

running (2m32.0s), 47/50 VUs, 3515 complete and 0 interrupted iterations
default   [  89% ] 47/50 VUs  2m32.0s/2m50.0s

running (2m33.0s), 48/50 VUs, 3559 complete and 0 interrupted iterations
default   [  90% ] 48/50 VUs  2m33.0s/2m50.0s

running (2m34.0s), 48/50 VUs, 3587 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  2m34.0s/2m50.0s

running (2m35.0s), 48/50 VUs, 3626 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  2m35.0s/2m50.0s

running (2m36.0s), 48/50 VUs, 3663 complete and 0 interrupted iterations
default   [  92% ] 48/50 VUs  2m36.0s/2m50.0s

running (2m37.0s), 49/50 VUs, 3690 complete and 0 interrupted iterations
default   [  92% ] 49/50 VUs  2m37.0s/2m50.0s

running (2m38.0s), 49/50 VUs, 3738 complete and 0 interrupted iterations
default   [  93% ] 49/50 VUs  2m38.0s/2m50.0s

running (2m39.0s), 49/50 VUs, 3755 complete and 0 interrupted iterations
default   [  94% ] 49/50 VUs  2m39.0s/2m50.0s

running (2m40.0s), 49/50 VUs, 3772 complete and 0 interrupted iterations
default   [  94% ] 49/50 VUs  2m40.0s/2m50.0s

running (2m41.0s), 48/50 VUs, 3820 complete and 0 interrupted iterations
default   [  95% ] 48/50 VUs  2m41.0s/2m50.0s

running (2m42.0s), 46/50 VUs, 3840 complete and 0 interrupted iterations
default   [  95% ] 46/50 VUs  2m42.0s/2m50.0s

running (2m43.0s), 39/50 VUs, 3872 complete and 0 interrupted iterations
default   [  96% ] 39/50 VUs  2m43.0s/2m50.0s

running (2m44.0s), 35/50 VUs, 3897 complete and 0 interrupted iterations
default   [  96% ] 35/50 VUs  2m44.0s/2m50.0s

running (2m45.0s), 28/50 VUs, 3927 complete and 0 interrupted iterations
default   [  97% ] 28/50 VUs  2m45.0s/2m50.0s

running (2m46.0s), 24/50 VUs, 3949 complete and 0 interrupted iterations
default   [  98% ] 24/50 VUs  2m46.0s/2m50.0s

running (2m47.0s), 18/50 VUs, 3973 complete and 0 interrupted iterations
default   [  98% ] 18/50 VUs  2m47.0s/2m50.0s

running (2m48.0s), 13/50 VUs, 3991 complete and 0 interrupted iterations
default   [  99% ] 13/50 VUs  2m48.0s/2m50.0s

running (2m49.0s), 09/50 VUs, 4000 complete and 0 interrupted iterations
default   [  99% ] 09/50 VUs  2m49.0s/2m50.0s

running (2m50.0s), 05/50 VUs, 4007 complete and 0 interrupted iterations
default   [ 100% ] 05/50 VUs  2m50.0s/2m50.0s

running (2m51.0s), 01/50 VUs, 4011 complete and 0 interrupted iterations
default ↓ [ 100% ] 05/50 VUs  2m50s


  █ TOTAL RESULTS 

    checks_total.......................: 12036   70.381186/s
    checks_succeeded...................: 100.00% 12036 out of 12036
    checks_failed......................: 0.00%   0 out of 12036

    ✓ orders list: status 200
    ✓ order detail: status 200
    ✓ user info: status 200

    HTTP
    http_req_duration.......................................................: avg=73.7ms min=8.02ms med=43.41ms max=844.52ms p(90)=168.72ms p(95)=209.47ms
      { expected_response:true }............................................: avg=73.7ms min=8.02ms med=43.41ms max=844.52ms p(90)=168.72ms p(95)=209.47ms
    http_req_failed.........................................................: 0.00%  0 out of 12036
    http_reqs...............................................................: 12036  70.381186/s

    EXECUTION
    iteration_duration......................................................: avg=1.22s  min=1.03s  med=1.14s   max=2.39s    p(90)=1.49s    p(95)=1.57s   
    iterations..............................................................: 4012   23.460395/s
    vus.....................................................................: 1      min=1          max=49
    vus_max.................................................................: 50     min=50         max=50

    NETWORK
    data_received...........................................................: 739 MB 4.3 MB/s
    data_sent...............................................................: 5.0 MB 29 kB/s



running (2m51.0s), 00/50 VUs, 4012 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  2m50s